//
//  myLogic.swift
//  iSeeYouAgainApp
//
//  Created by mac on 16.07.2019.
//  Copyright © 2019 sashabalabon. All rights reserved.
//

import Foundation

struct eyeWorkouts {
    let description: String
    let image: String
    let tittle: String

}

let infoOne = eyeWorkouts.init(description: "Первое упражнение делаем утром, либо вечером когда вы умываетесь. Упражнения укрепляет сосуды глаза. Сначала вы умываетесь горячей водой, и старайтесь какое-то время подержать руки с водой прямо на глаза, а после резко менять экран на холодную воду. И также старайтесь поддержать холодную воду ладошках на глазах. Буквально три таких контрастных ванн для глаз", image: "PalmsHydro", tittle: "Гидромассаж для глаз")
let infoTwo = eyeWorkouts.init(description: "Второе упражнение. Берёте палец и относительно его на расстоянии 10-15 см. Смотрите на кончик пальца глазами и начинайте приближать палец к носу. И в конце смотрите на кончик своего носа. После, также удаляете палец от глаз на расстояния 10-15 см и следите за ним. И так, повторяйте десять раз. Вы подводите палец к носу и убирайте его обратно и следите глазами", image: "fartherСloserАinger", tittle: "Фокусировка на цели")
let infoThree = eyeWorkouts.init(description: "Третье упражнения это сильное сжимание и разжимание глаз. Вы сильно сжали глаза, чтобы зажмуриться и сильно разжали. И так повторяйте 10 раз. А между этими упражнениями вы легко и быстро помограли глазами, и переходите к следующему упражнению", image: "closeOpenEye", tittle: "Сжимание и разжимание глаз")

let infoFour = eyeWorkouts.init(description: "Упражнение номер четыре это рисование линий глазами. Первая часть упражнение это вертикальные движения глазами вверх-вниз с максимальной скоростью и амплитудой. А вторая часть упражнение это движение глазами только горизонтально. Также с максимальной скоростью. И в конце сделайте движения по диагонали, как можно быстрее. Также повторяйте 10 раз", image: "doubleCross", tittle: "Рисование линий")

let infoFive = eyeWorkouts.init(description: "Пятое упражнение состоит из рисования пяти фигур. Каждую фигуру рисуем глазами 10 раз. Нужно нарисовать ромб, круг, восьмёрку, треугольник и квадрат. Каждый фигуру по десять раз. Первые пять раз по часовой стрелке вторые  против часовой", image: "finalFiveFigures", tittle: "Рисование пяти фигур")
let infoSix = eyeWorkouts.init(description: "Шестое упражнение самое важное и должно быть последним. Нам нужен какой-то близкий предмет и отдалённый. Отдалённый предмет может быть шпиль дома, а близким — цветок на подоконнике либо палец. Сначала мы фокусируемся на близкой точке, далее переводим фокус на отдалённые предмет. И так, нужно постоянно менять положение глаз. Именно после это упражнение вы почувствуете что острота зрения усилилась. Это упражнения можно сделать 10–20 раз. В промежутке, не забывайте поморгать, чтобы глаза не устали", image: "moon1", tittle: "Восстановление аккомодации")
