//
//  myLogic.swift
//  iSeeYouAgainApp
//
//  Created by mac on 16.07.2019.
//  Copyright © 2019 sashabalabon. All rights reserved.
//

import Foundation

struct eyeWorkouts {
    let description: String
    let image: String
    let tittle: String

}

let infoOne = eyeWorkouts.init(description: "Первое упражнение называется гидромассаж глаз. Его делать очень просто либо утром либо вечером когда вы умываетесь. Упражнения укрепляет сосуды глаза. Сначала вы умываетесь горячей водой и старайтесь какое-то время подержать руки с водой прямо на глаза а после резко менять экран на холодную воду. И также старайтесь поддержать холодную воду ладошках на глазах.Буквально три таких контрастных ванн для глаз.", image: "PalmsHydro", tittle: "Гидромассаж")
let infoTwo = eyeWorkouts.init(description: "Второе упражнение. Берёте палец и относительно его на расстоянии 10-15 см. Смотрите на кончик пальца глазами и начинайте приближать палец к носу. И в конце смотрите на кончик своего носа. После, также удаляете палец от глаз на расстояния  10-15 см и следите за ним. И так повторяйте десят раз. Вы подводите палец к носу и убирайте его обратно и следите глазами.", image: "two", tittle: "Отводим палец от себя, потом к себе.")
let infoThree = eyeWorkouts.init(description: "Третье упражнения сильная сжимание и расжимание глаз. Вы сильно сжали чтобы так рад зажмуриться и сильно расжали. Итак повторяйте 10 раз.А между всеми упражнениями вы легко и быстро моргаете глазами , и переходите к следующему упражнению.", image: "three", tittle: "Сжимание и разжимание глаз")

let infoFour = eyeWorkouts.init(description: "Упражнение номер четыре это рисование линий глазами. Первая часть упражнение это вертикальные движения глазами вверх вниз. С максимальной скоростью и амплитудой. И как можно быстрее. А вторая часть упражнение это движение глазами только горизонтально. Также с максимальной скорости. Также повторяйте 10 раз.", image: "four", tittle: "Рисование линий")

let infoFive = eyeWorkouts.init(description: "Пятое упражнение состоит из рисование пяти фигур. Каждую фигуру рисуем глазами 10 раз. Нужно нарисовать ромб круг восьмёрку треугольник и квадрат. Каждый фигуру по десят раз. Первые пять раза по часовой стрелке вторые против.", image: "five", tittle: "Рисуем 5 фигур по 10 раз")
let infoSix = eyeWorkouts.init(description: "И последнее шестое упражнение, которое обязательно должно быть последним. Это упражнение закрепляющие и самое важное. Упражнения на восстановление аккомодации. Нам нужен какой-то близкий предмет и отдалённый. Лучше всего упражнения делать перед окном. Отдалённый предмет может быть шпиль какого-то дома. Близким предметом может быть цветок на подоконнике либо. На стекле. Если нет такого предмета то можно поставить собственный палец. Сначала мы фокусируемся на близкой точки пальцы далее пили фокусируемся на отдалённые предмет. Итак нужно постоянно менять положение глаз.Чем ближе и дальше находится эти два разных предмета чем сильнее мы прокачиваем мышцы связочного аппарата хрусталика. Именно это упражнение сразу даст эффект вы почувствуете что острота зрения усилась после того как вы его сделаете. Поскольку это самое важное упражнения вы можете его сделать 10 – 20 раз. В промежутке этого упражнения не забывайте помогать чтобы глаза не так сильно устали. Старайтесь как можно чательно рассматривать детали на этих предметах.", image: "six", tittle: "Фокусирование зрения")


